# Manipulación de datos con Pandas

[Pandas](http://pandas.pydata.org/)  es un paquete de Python que proporciona estructuras de datos similares a los dataframes de R. Pandas depende de Numpy, la librería que añade un potente tipo matricial a Python. Los principales tipos de datos que pueden representarse con pandas son:

> -   Datos tabulares con columnas de tipo heterogéneo con etiquetas en columnas y filas.
> -   Series temporales.

Pandas proporciona herramientas que permiten:

> -   leer y escribir datos en diferentes formatos: CSV, Microsoft Excel, bases SQL y formato HDF5
> -   seleccionar y filtrar de manera sencilla tablas de datos en función de posición, valor o etiquetas
> -   fusionar y unir datos
> -   transformar datos aplicando funciones tanto en global como por ventanas
> -   manipulación de series temporales
> -   hacer gráficas

En pandas existen tres tipos básicos de objetos todos ellos basados a su vez en Numpy:

> -   Series (listas, 1D),
> -   DataFrame (tablas, 2D) y
> -   Panels (tablas 3D).

In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.0.3'

## El objeto Series en pandas

A la izquierda del array están los índices (indexes), en este caso explícitos por no especificarlos.

In [7]:
data = pd.Series([0.25, 0.5, 0.75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [8]:
type(data)

pandas.core.series.Series

In [9]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [10]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
data[1]

0.5

In [12]:
data[1:3]

1    0.50
2    0.75
dtype: float64

### Series como arrays de NumPy

In [14]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [15]:
data['a']

0.25

In [16]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

### Series como diccionario especializado

In [17]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [18]:
population['California']

38332521

In [19]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

### Construyendo un objeto series

In [20]:
pd.Series(5, index=[100, 200, 300]) # extiende según índices

100    5
200    5
300    5
dtype: int64

## El objeto DataFrame en pandas

### DataFrame como una generalización del array de NumPy

In [21]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [25]:
states = pd.DataFrame({'population': population, 'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [34]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [35]:
states.columns

Index(['population', 'area'], dtype='object')

### DataFrames como diccionario especializado

In [40]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

### Construyendo DataFrames

#### Desde un objeto series

In [42]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

#### Desde una lista de diccionarios

In [47]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [46]:
pd.DataFrame([{'a': 0, 'b': 0}, {'c': 1, 'c': 2}, {'a': 2, 'b': 4}])

     a    b    c
0  0.0  0.0  NaN
1  NaN  NaN  2.0
2  2.0  4.0  NaN

#### Desde un diccionario de series

In [49]:
pd.DataFrame({'population': population,
              'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

#### Desde un array bidimensional de numpy

In [51]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

        foo       bar
a  0.399952  0.167661
b  0.930453  0.986641
c  0.122141  0.375102

#### Desde un array estructurado de numpy

In [52]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [53]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## Los índices de pandas

In [55]:
ind = pd.Index([2, 3, 5, 7, 11]) # índices explícitos
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

### Índices como un array inmutable

In [56]:
ind[1]

3

In [57]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [58]:
ind[1] = 0 # dará error, ya que es INMUTABLE

TypeError: Index does not support mutable operations

### Índices como un conjunto ordenado

In [59]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [60]:
indA & indB  # intersection

Int64Index([3, 5, 7], dtype='int64')

In [61]:
indA | indB  # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [62]:
indA ^ indB  # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

## Indexado de datos y selecciones

## Selección de datos en series

### Series como un diccionario

In [66]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [68]:
data['b'] # acceder por su índice

0.5

In [69]:
'a' in data

True

In [70]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [71]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

### Series como un array unidimensional

In [76]:
# slicing mediante el índice explícito o indicado
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [77]:
# slicing por entero implícito (si los índices no son números)
data[0:2]

a    0.25
b    0.50
dtype: float64

In [78]:
# usando máscaras
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [89]:
# solo pares
data[1::2] #esto no rula

b    0.5
d    1.0
dtype: float64

In [79]:
# mediante fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

### Usando indexers: `loc` e `iloc`

In [90]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [91]:
# explicit index when indexing
data[1]

'a'

In [92]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

Como esto es muy confuso, podremos usar los indexers:
- `loc`: Siempre hace referencia al índice explícito (el que no indicamos)

In [93]:
data.loc[1]

'a'

In [94]:
data.loc[1:3]

1    a
3    b
dtype: object

- `iloc`: Siempre hace referencia al índice implícito (el que indicamos al crear la serie)

In [95]:
data.iloc[1]

'b'

In [96]:
data.iloc[1:3]

3    b
5    c
dtype: object

## Selección de datos en DataFrames

### DataFrames como diccionario

In [176]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [100]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [101]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [102]:
data.area is data['area']

True

In [103]:
data.pop is data['pop']

False

In [177]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [122]:
data.reindex(columns=['density','area', 'pop']) # esto no tiene que ver pero mola

               density    area       pop
California   90.413926  423967  38332521
Texas        38.018740  695662  26448193
New York    139.076746  141297  19651127
Florida     114.806121  170312  19552860
Illinois     85.883763  149995  12882135

In [123]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### DataFrame como array bidimensional

In [110]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [112]:
data.T # hacemos un swap de filas y columnas

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [114]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [115]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [117]:
data['area']['California']

423967

In [121]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [119]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [128]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [129]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [139]:
data.loc['California','density'] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [179]:
data['pop'] *= 0.9
data

              area         pop     density
California  423967  34499268.9   90.413926
Texas       695662  23803373.7   38.018740
New York    141297  17686014.3  139.076746
Florida     170312  17597574.0  114.806121
Illinois    149995  11593921.5   85.883763

### Indexado adicional por convenio

In [124]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [125]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [126]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

# Ejercicio: Dataset de titanic

In [186]:
titanic = pd.read_csv( 'titanic.csv')

In [189]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [190]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [191]:
# Filtrar rows con gente que pagó menos de $7

In [197]:
titanic[titanic['Fare'] < 7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
129,130,0,3,"Ekstrom, Mr. Johan",male,45.0,0,0,347061,6.9750,NaN,S
143,144,0,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.7500,NaN,Q
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0000,NaN,S
202,203,0,3,"Johanson, Mr. Jakob Alfred",male,34.0,0,0,3101264,6.4958,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0000,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
371,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S
378,379,0,3,"Betros, Mr. Tannous",male,20.0,0,0,2648,4.0125,NaN,C
411,412,0,3,"Hart, Mr. Henry",male,NaN,0,0,394140,6.8583,NaN,Q
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0000,NaN,S
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0000,NaN,S
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0000,NaN,S
654,655,0,3,"Hegarty, Miss. Hanora ""Nora""",female,18.0,0,0,365226,6.7500,NaN,Q
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0000,NaN,S
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S
804,805,1,3,"Hedman, Mr. Oskar Arvid",male,27.0,0,0,347089,6.9750,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
818,819,0,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.4500,NaN,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S
825,826,0,3,"Flynn, Mr. John",male,NaN,0,0,368323,6.9500,NaN,Q
843,844,0,3,"Lemberopolous, Mr. Peter L",male,34.5,0,0,2683,6.4375,NaN,C
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S

In [207]:
# Sólo nos interesa nombre y edad

In [206]:
titanic[titanic['Fare'] < 7][['Name','Age']]

                                 Name   Age
129                Ekstrom, Mr. Johan  45.0
143               Burke, Mr. Jeremiah  19.0
179               Leonard, Mr. Lionel  36.0
202        Johanson, Mr. Jakob Alfred  34.0
263             Harrison, Mr. William  40.0
271      Tornquist, Mr. William Henry  25.0
277       Parkes, Mr. Francis "Frank"   NaN
302   Johnson, Mr. William Cahoone Jr  19.0
326         Nysveen, Mr. Johan Hansen  61.0
371         Wiklund, Mr. Jakob Alfred  18.0
378               Betros, Mr. Tannous  20.0
411                   Hart, Mr. Henry   NaN
413    Cunningham, Mr. Alfred Fleming   NaN
466             Campbell, Mr. William   NaN
481  Frost, Mr. Anthony Wood "Archie"   NaN
597               Johnson, Mr. Alfred  49.0
633     Parr, Mr. William Henry Marsh   NaN
654      Hegarty, Miss. Hanora "Nora"  18.0
674        Watson, Mr. Ennis Hastings   NaN
732              Knight, Mr. Robert J   NaN
804           Hedman, Mr. Oskar Arvid  27.0
806            Andrews, Mr. Thomas Jr  39.0
815                  Fry, Mr. Richard   NaN
818  Holm, Mr. John Fredrik Alexander  43.0
822   Reuchlin, Jonkheer. John George  38.0
825                   Flynn, Mr. John   NaN
843        Lemberopolous, Mr. Peter L  34.5
872          Carlsson, Mr. Frans Olof  33.0

In [209]:
# Podemos ordenar la vista:

titanic[titanic['Fare'] < 7][['Name','Age','Fare']].sort_values('Fare', ascending=False)

                                 Name   Age    Fare
129                Ekstrom, Mr. Johan  45.0  6.9750
804           Hedman, Mr. Oskar Arvid  27.0  6.9750
825                   Flynn, Mr. John   NaN  6.9500
411                   Hart, Mr. Henry   NaN  6.8583
654      Hegarty, Miss. Hanora "Nora"  18.0  6.7500
143               Burke, Mr. Jeremiah  19.0  6.7500
202        Johanson, Mr. Jakob Alfred  34.0  6.4958
371         Wiklund, Mr. Jakob Alfred  18.0  6.4958
818  Holm, Mr. John Fredrik Alexander  43.0  6.4500
843        Lemberopolous, Mr. Peter L  34.5  6.4375
326         Nysveen, Mr. Johan Hansen  61.0  6.2375
872          Carlsson, Mr. Frans Olof  33.0  5.0000
378               Betros, Mr. Tannous  20.0  4.0125
413    Cunningham, Mr. Alfred Fleming   NaN  0.0000
466             Campbell, Mr. William   NaN  0.0000
597               Johnson, Mr. Alfred  49.0  0.0000
633     Parr, Mr. William Henry Marsh   NaN  0.0000
302   Johnson, Mr. William Cahoone Jr  19.0  0.0000
674        Watson, Mr. Ennis Hastings   NaN  0.0000
732              Knight, Mr. Robert J   NaN  0.0000
277       Parkes, Mr. Francis "Frank"   NaN  0.0000
806            Andrews, Mr. Thomas Jr  39.0  0.0000
815                  Fry, Mr. Richard   NaN  0.0000
271      Tornquist, Mr. William Henry  25.0  0.0000
822   Reuchlin, Jonkheer. John George  38.0  0.0000
263             Harrison, Mr. William  40.0  0.0000
179               Leonard, Mr. Lionel  36.0  0.0000
481  Frost, Mr. Anthony Wood "Archie"   NaN  0.0000

In [210]:
# Incluso con ordenaciones secundarias:

titanic[titanic['Fare'] < 7][['Name','Age','Fare']].sort_values(['Age', 'Fare'])

                                 Name   Age    Fare
371         Wiklund, Mr. Jakob Alfred  18.0  6.4958
654      Hegarty, Miss. Hanora "Nora"  18.0  6.7500
302   Johnson, Mr. William Cahoone Jr  19.0  0.0000
143               Burke, Mr. Jeremiah  19.0  6.7500
378               Betros, Mr. Tannous  20.0  4.0125
271      Tornquist, Mr. William Henry  25.0  0.0000
804           Hedman, Mr. Oskar Arvid  27.0  6.9750
872          Carlsson, Mr. Frans Olof  33.0  5.0000
202        Johanson, Mr. Jakob Alfred  34.0  6.4958
843        Lemberopolous, Mr. Peter L  34.5  6.4375
179               Leonard, Mr. Lionel  36.0  0.0000
822   Reuchlin, Jonkheer. John George  38.0  0.0000
806            Andrews, Mr. Thomas Jr  39.0  0.0000
263             Harrison, Mr. William  40.0  0.0000
818  Holm, Mr. John Fredrik Alexander  43.0  6.4500
129                Ekstrom, Mr. Johan  45.0  6.9750
597               Johnson, Mr. Alfred  49.0  0.0000
326         Nysveen, Mr. Johan Hansen  61.0  6.2375
277       Parkes, Mr. Francis "Frank"   NaN  0.0000
413    Cunningham, Mr. Alfred Fleming   NaN  0.0000
466             Campbell, Mr. William   NaN  0.0000
481  Frost, Mr. Anthony Wood "Archie"   NaN  0.0000
633     Parr, Mr. William Henry Marsh   NaN  0.0000
674        Watson, Mr. Ennis Hastings   NaN  0.0000
732              Knight, Mr. Robert J   NaN  0.0000
815                  Fry, Mr. Richard   NaN  0.0000
411                   Hart, Mr. Henry   NaN  6.8583
825                   Flynn, Mr. John   NaN  6.9500

In [211]:
# De la gente que sobrevivió, cuál era la media de edad

In [218]:
titanic[titanic['Survived'] == 1]['Age'].mean()

28.343689655172415

## Operando los datos en Pandas

In [2]:
import pandas as pd
import numpy as np

### Ufuncs: Preservación de los índices

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [4]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [5]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [6]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

### Ufuncs: Alineación de los índices

In [9]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [10]:
population

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [16]:
population / area # aparecen NaN y se cambia el tipo de float64, ya que NaN no existe en int

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [13]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [14]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [21]:
res = A.add(B, fill_value=0) # Los valores que faltan se rellenan con 0

In [22]:
res

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [24]:
res.convert_dtypes()

0    2
1    5
2    9
3    5
dtype: Int64

### Alineamiento de los índices en un DataFrame

In [29]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  19   2
1   4  18

In [30]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  6  4  8
1  6  1  3
2  8  1  9

In [31]:
A + B

      A     B   C
0  23.0   8.0 NaN
1   5.0  24.0 NaN
2   NaN   NaN NaN

In [35]:
A.stack()

0  A    19
   B     2
1  A     4
   B    18
dtype: int64

In [34]:
fill = A.stack().mean() # stack crea multi-índices
A.add(B, fill_value=fill)

       A      B      C
0  23.00   8.00  18.75
1   5.00  24.00  13.75
2  11.75  18.75  19.75

**Operadores de métodos:**

- `+`	add()
- `-`	sub(), subtract()
- `*`	mul(), multiply()
- `/`	truediv(), div(), divide()
- `//`	floordiv()
- `%`	mod()
- `**`	pow()

### Operando DataFrames con Series

In [36]:
A = rng.randint(10, size=(3, 4))
A

array([[8, 9, 4, 1],
       [3, 6, 7, 2],
       [0, 3, 1, 7]])

In [37]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-5, -3,  3,  1],
       [-8, -6, -3,  6]])

In [39]:
df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  8  9  4  1
1  3  6  7  2
2  0  3  1  7

In [40]:
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -5 -3  3  1
2 -8 -6 -3  6

In [41]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -1  0 -5 -8
1 -3  0  1 -4
2 -3  0 -2  4

In [42]:
halfrow = df.iloc[0, ::2]
halfrow

Q    8
S    4
Name: 0, dtype: int64

In [43]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -5.0 NaN  3.0 NaN
2 -8.0 NaN -3.0 NaN

## Manejo de los datos perdidos u omitidos

## Datos perdidos en Pandas

Pandas acaba usando NaN desde el punto de vista de float y el objeto None de Python

### `None`: Datos perdidos pythónicos

In [45]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [46]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
49.7 ms ± 3.35 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.52 ms ± 6.4 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [48]:
vals1.max() # no puede calcular el máximo con el None

TypeError: '>=' not supported between instances of 'int' and 'NoneType'

### `NaN`: Pérdidas de datos numéricos

In [49]:
vals2 = np.array([1, np.nan, 3, 4]) 
vals2.dtype

dtype('float64')

In [50]:
1 + np.nan

nan

In [51]:
0 *  np.nan

nan

In [52]:
vals2.sum(), vals2.min(), vals2.max() # al menos no da error

(nan, nan, nan)

In [53]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [54]:
np.nan == np.nan

False

### `NaN` y `None` en Pandas

In [55]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [56]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

## Tipo de dato entero nulable
**Fuente:** https://pandas.pydata.org/pandas-docs/stable/user_guide/integer_na.html

Desde hace poco todos los dtypes propios de panda (tip, los que empiezan en mayúscula) saben interpretar un NA.

In [58]:
pd.NA

In [60]:
arr = pd.array([1, 2, None], dtype=pd.Int64Dtype())
arr

<IntegerArray>
[1, 2, <NA>]
Length: 3, dtype: Int64

In [61]:
pd.array([1, 2, np.nan], dtype="Int64")

<IntegerArray>
[1, 2, <NA>]
Length: 3, dtype: Int64

In [62]:
pd.array([1, 2, np.nan, None, pd.NA], dtype="Int64")

<IntegerArray>
[1, 2, <NA>, <NA>, <NA>]
Length: 5, dtype: Int64

In [63]:
pd.Series(arr)

0       1
1       2
2    <NA>
dtype: Int64

### Operaciones

In [66]:
s = pd.Series([1, 2, None], dtype="Int64")
s + 1

0       2
1       3
2    <NA>
dtype: Int64

In [67]:
s == 1

0     True
1    False
2     <NA>
dtype: boolean

In [68]:
s.iloc[1:3]

1       2
2    <NA>
dtype: Int64

In [70]:
s + s.iloc[1:3].astype('Int8') # suma con otros dtype's

0    <NA>
1       4
2    <NA>
dtype: Int64

In [72]:
s + 0.01 # aquí pasamos a coma flotante y volvemos a cambiar el dtype

0    1.01
1    2.01
2     NaN
dtype: float64

In [73]:
df = pd.DataFrame({'A': s, 'B': [1, 1, 3], 'C': list('aab')})
df

      A  B  C
0     1  1  a
1     2  1  a
2  <NA>  3  b

In [74]:
df.dtypes

A     Int64
B     int64
C    object
dtype: object

Se pueden hacer multitud de operaciones y el dtype no varía.

In [75]:
pd.concat([df[['A']], df[['B', 'C']]], axis=1).dtypes

A     Int64
B     int64
C    object
dtype: object

In [76]:
df.sum()

A      3
B      5
C    aab
dtype: object

In [78]:
df.groupby('B').A.sum() # agrupamos

B
1    3
3    0
Name: A, dtype: Int64

### Valores `NA` escalares

In [79]:
a = pd.array([1, None], dtype="Int64")

In [80]:
a

<IntegerArray>
[1, <NA>]
Length: 2, dtype: Int64

In [81]:
a[1]

## Operaciones con valores nulos

- `isnull()`: Generate a boolean mask indicating missing values
- `notnull()`: Opposite of isnull()
- `dropna()`: Return a filtered version of the data
- `fillna()`: Return a copy of the data with missing values filled or imputed

### Detectando valores nulos

In [88]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [83]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [84]:
data[data.notnull()]

0        1
2    hello
dtype: object

### Dropeando los valores nulos

In [86]:
data.dropna()

0        1
2    hello
dtype: object

In [87]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [89]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [91]:
df.dropna(axis='columns') # axis=1

   2
0  2
1  5
2  6

¿Quieres dropear las filas/columnas que sean mayoritaritamenter NA?

In [92]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [93]:
df.dropna(axis='columns', how='all') # how es cómo se los quita

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [96]:
df.dropna(axis='rows', thresh=3) # valores mínimos para que la columna sea mantenida

     0    1  2   3
1  2.0  3.0  5 NaN

In [99]:
df.dropna(axis='columns', thresh=2)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

### Rellenando los valores nulos

In [100]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [101]:
data.fillna(0) # rellenamos con 0

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [104]:
# forward-fill -> Se propaga como si se derramara, es decir, copia el valor de arriba del nan
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [105]:
# back-fill -> Se propaga hacia arriba y no hacia abajo
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [106]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [107]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

Recuerda que para el fillna se intercambian las filas y las columnas.

In [113]:
df.fillna(method='ffill', axis=1).fillna(method='bfill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  4.0  4.0  6.0  6.0

## Ejemplo

In [167]:
titanic = pd.read_csv('titanic.csv')

In [116]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Sacar la media de edad pero contando que los NA son 0.

In [117]:
titanic['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [118]:
titanic['Age'].mean()

29.69911764705882

In [119]:
titanic['Age'].fillna(0).mean()

23.79929292929293

In [121]:
titanic['Age'].dropna()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

Lo mismo pero con máscaras booleanas

In [139]:
mask = titanic['Age'].notna()
titanic[mask]['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

In [140]:
titanic['Age'][titanic['Age'].notnull()]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

Rellenar los NA de Cabin, primero de arriba a abajo y luego a la inversa.

In [147]:
titanic['Cabin'].ffill().bfill()

0       C85
1       C85
2       C85
3      C123
4      C123
       ...
886     C50
887     B42
888     B42
889    C148
890    C148
Name: Cabin, Length: 891, dtype: object

In [172]:
pd.concat( [titanic.drop('Cabin',axis=1), titanic['Cabin'].ffill().bfill()],axis=1).reindex(columns=titanic.columns)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C85,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,C50,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,C148,Q

## Indexado jerárquico o multi-índice

### La forma incorrecta

In [178]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [176]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [179]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

### La mejor forma: Panda MultiIndexes

In [182]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [184]:
pop = pop.reindex(index) # volvemos a pasarle el index
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [188]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [187]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [190]:
pop.loc['California', :]

California  2000    33871648
            2010    37253956
dtype: int64

### MultiÍndice como una dimensión extra